# Joing and merging in pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'], 'B': ['B0', 'B1', 'B2']})
df2 = pd.DataFrame({'A': ['A3', 'A4', 'A5'], 'B': ['B3', 'B4', 'B5']})

In [3]:
df1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [4]:
df2

    A   B
0  A3  B3
1  A4  B4
2  A5  B5

In [5]:
pd.concat([df1, df2], axis=0)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4
2  A5  B5

In [6]:
pd.concat([df1, df2, df2], axis=0)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4
2  A5  B5
0  A3  B3
1  A4  B4
2  A5  B5

In [7]:
pd.concat([df1, df2], axis=0, ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B5

In [12]:
df3=pd.DataFrame({"C": ["C0", "C1", "C2", "C3"]})

In [13]:
pd.concat([df1, df3], axis=1)

     A    B   C
0   A0   B0  C0
1   A1   B1  C1
2   A2   B2  C2
3  NaN  NaN  C3

### Merging

In [14]:
# merge
df1 = pd.DataFrame({'key': ['K0', 'K1', 'K2'], 'A': ['A0', 'A1', 'A2']})
df2 = pd.DataFrame({'key': ['K1', 'K2', 'K3'], 'B': ['B1', 'B2', 'B3']})

In [15]:
df3 = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C4']})

In [16]:
df4=pd.DataFrame({"key": ["K0", "K1", "K2"], "A": ["A0", "A1", "A2"]})
df5=pd.DataFrame({"key": ["K1", "K2", "K3"], "B": ["B1", "B2", "B3"]})

In [18]:
pd.merge(
    left=df4,
    right=df5,
    how="outer",
    on="key"
)

  key    A    B
0  K0   A0  NaN
1  K1   A1   B1
2  K2   A2   B2
3  K3  NaN   B3

In [17]:
pd.merge(
    left=df4,
    right=df5,
    how="inner",
    on="key"
)

  key   A   B
0  K1  A1  B1
1  K2  A2  B2

In [19]:
pd.merge(
    left=df4,
    right=df5,
    how="left",
    on="key"
)

  key   A    B
0  K0  A0  NaN
1  K1  A1   B1
2  K2  A2   B2

In [20]:
pd.merge(
    left=df5,
    right=df4,
    how="left",
    on="key"
)

  key   B    A
0  K1  B1   A1
1  K2  B2   A2
2  K3  B3  NaN

In [21]:
pd.merge(
    left=df4,
    right=df5,
    how="right",
    on="key"
)

  key    A   B
0  K1   A1  B1
1  K2   A2  B2
2  K3  NaN  B3

In [23]:
pd.merge(
    left=df4,
    right=df5,
    how="cross",
    # on="key"
    suffixes=("_left", "_right")
)

  key_left   A key_right   B
0       K0  A0        K1  B1
1       K0  A0        K2  B2
2       K0  A0        K3  B3
3       K1  A1        K1  B1
4       K1  A1        K2  B2
5       K1  A1        K3  B3
6       K2  A2        K1  B1
7       K2  A2        K2  B2
8       K2  A2        K3  B3

In [25]:
df6 = pd.DataFrame({'name': ['A', 'B', 'C'], 'points': [8, 12, 19], 'common': [1, 2, 3]})
df7 = pd.DataFrame({'name': ['A', 'B', 'C'], 'steals': [4, 5, 2], 'common': [4, 5, 6]})

In [26]:
pd.merge(
left=df6,
right=df7,
on=["name", "common"],
how="outer"
)

  name  points  common  steals
0    A     8.0       1     NaN
1    A     NaN       4     4.0
2    B    12.0       2     NaN
3    B     NaN       5     5.0
4    C    19.0       3     NaN
5    C     NaN       6     2.0

### Join

In [28]:
df8 = pd.DataFrame({'A': ['A0', 'A1', 'A2']}, index=['K0', 'K1', 'K2'])
df9 = pd.DataFrame({'B': ['B1', 'B2', 'B3']}, index=['K1', 'K2', 'K3'])

In [29]:
df8

     A
K0  A0
K1  A1
K2  A2

In [30]:
df9

     B
K1  B1
K2  B2
K3  B3

In [31]:
df8.join(df9, how="outer")

      A    B
K0   A0  NaN
K1   A1   B1
K2   A2   B2
K3  NaN   B3

In [32]:
df8.join(df9, how="inner")

     A   B
K1  A1  B1
K2  A2  B2

In [33]:
df8.join(df9, how="left")

     A    B
K0  A0  NaN
K1  A1   B1
K2  A2   B2

In [34]:
df8.join(df9, how="right")

      A   B
K1   A1  B1
K2   A2  B2
K3  NaN  B3